
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.Склад);
	ВыбранныеТовары.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресВХ));
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеТоварыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Для Каждого Элем Из ПараметрыПеретаскивания.Значение Цикл
		стр = ВыбранныеТовары.Добавить();
		стр.Товар = Элем;
		стр.Количество = 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыбор(Команда)
	ЗавершитьВыборНаСервере();
	ВладелецФормы.ОбработатьПодбор(Параметры.АдресВХ);
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗавершитьВыборНаСервере()
	ПоместитьВоВременноеХранилище(ВыбранныеТовары.Выгрузить(), Параметры.АдресВХ);
КонецПроцедуры


